The cable tray has been modified to be in the opposite direction or insufficient space to create the required fittings.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CableTrayModified { get; }
  Visual Basic
Public Shared ReadOnly Property CableTrayModified As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CableTrayModified {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ElectricalFailures Class
  Autodesk.Revit.DB Namespace